# 练习

In [1]:
import numpy as np
import pandas as pd
import time
import errno

In [2]:
s3 = pd.Series({'语文':90,'数学':92,'英语':98,'物理':87,'化学':92})

In [3]:
s3.idxmax()

'英语'

In [4]:
s3.idxmin()

'物理'

In [5]:
s3[s3>90]

数学    92
英语    98
化学    92
dtype: int64

# 1

In [6]:
data = {'城市':['北京','上海','广州','深圳'],
        '环比':[101.5,101.2,101.3,102.0],
        '同比':[120.7,127.3,119.4,140.9],
        '定基':[121.4,127.8,120.0,145.5]}
pd1 = pd.DataFrame(data,index=['c1','c2','c3','c4'])

In [7]:
pd1

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5

In [8]:
pd1['同比']

c1    120.7
c2    127.3
c3    119.4
c4    140.9
Name: 同比, dtype: float64

In [9]:
type(pd1[1:2])

pandas.core.frame.DataFrame

In [10]:
type(pd1.loc['c2'])

pandas.core.series.Series

# 2

In [11]:
pd1.iloc[:,[0,2]][pd1.iloc[:,2]>120]

    城市     同比
c1  北京  120.7
c2  上海  127.3
c4  深圳  140.9

In [12]:
pd1.loc[:,['城市','同比']][pd1.loc[:,'同比']>120]

    城市     同比
c1  北京  120.7
c2  上海  127.3
c4  深圳  140.9

In [13]:
pd1

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5

In [14]:
pd1['评价指数']=100.0

In [15]:
pd1

    城市     环比     同比     定基   评价指数
c1  北京  101.5  120.7  121.4  100.0
c2  上海  101.2  127.3  127.8  100.0
c3  广州  101.3  119.4  120.0  100.0
c4  深圳  102.0  140.9  145.5  100.0

In [16]:
pd1.drop(labels='评价指数',axis=1)

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5

# 3

In [17]:
data = {'数据信息学院':np.random.randint(1,100,10),
        '文化教育学院':np.random.randint(1,100,10),
        '机电汽修学院':np.random.randint(1,100,10)}

In [18]:
data

{'数据信息学院': array([28, 15, 56, 59, 18,  7, 88, 59, 90, 11]),
 '文化教育学院': array([38,  3, 72,  6, 27, 26, 66, 45, 32, 30]),
 '机电汽修学院': array([84, 67, 26, 43, 93, 50, 87, 24, 86, 82])}

In [19]:
from datetime import datetime
date = pd.date_range(start='202010100800',end='202010101700',freq='H')

In [20]:
date

DatetimeIndex(['2020-10-10 08:00:00', '2020-10-10 09:00:00',
               '2020-10-10 10:00:00', '2020-10-10 11:00:00',
               '2020-10-10 12:00:00', '2020-10-10 13:00:00',
               '2020-10-10 14:00:00', '2020-10-10 15:00:00',
               '2020-10-10 16:00:00', '2020-10-10 17:00:00'],
              dtype='datetime64[ns]', freq='H')

In [21]:
pd3 = pd.DataFrame(data,index=date)

In [22]:
pd3

                     数据信息学院  文化教育学院  机电汽修学院
2020-10-10 08:00:00      28      38      84
2020-10-10 09:00:00      15       3      67
2020-10-10 10:00:00      56      72      26
2020-10-10 11:00:00      59       6      43
2020-10-10 12:00:00      18      27      93
2020-10-10 13:00:00       7      26      50
2020-10-10 14:00:00      88      66      87
2020-10-10 15:00:00      59      45      24
2020-10-10 16:00:00      90      32      86
2020-10-10 17:00:00      11      30      82

In [23]:
print(pd3.resample('H').sum())

                     数据信息学院  文化教育学院  机电汽修学院
2020-10-10 08:00:00      28      38      84
2020-10-10 09:00:00      15       3      67
2020-10-10 10:00:00      56      72      26
2020-10-10 11:00:00      59       6      43
2020-10-10 12:00:00      18      27      93
2020-10-10 13:00:00       7      26      50
2020-10-10 14:00:00      88      66      87
2020-10-10 15:00:00      59      45      24
2020-10-10 16:00:00      90      32      86
2020-10-10 17:00:00      11      30      82

# 4

In [24]:
A = pd.read_csv('d:/Desktop/meal_order_info.csv',encoding='gbk')
A

,info_id,emp_id,number_consumers,mode,dining_table_id,dining_table_name,expenditure,dishes_count,accounts_payable,use_start_time,...,lock_time,cashier_id,pc_id,order_number,org_id,print_doc_bill_num,lock_table_info,order_status,phone,name
0,417,1442,4,NaN,1501,1022,165,5,165,2016/8/1 11:05:36,...,2016/8/1 11:11:46,NaN,NaN,NaN,330,NaN,NaN,1,18688880641,苗宇怡
1,301,1095,3,NaN,1430,1031,321,6,321,2016/8/1 11:15:57,...,2016/8/1 11:31:55,NaN,NaN,NaN,328,NaN,NaN,1,18688880174,赵颖
2,413,1147,6,NaN,1488,1009,854,15,854,2016/8/1 12:42:52,...,2016/8/1 12:54:37,NaN,NaN,NaN,330,NaN,NaN,1,18688880276,徐毅凡
3,415,1166,4,NaN,1502,1023,466,10,466,2016/8/1 12:51:38,...,2016/8/1 13:08:20,NaN,NaN,NaN,330,NaN,NaN,1,18688880231,张大鹏
4,392,1094,10,NaN,1499,1020,704,24,704,2016/8/1 12:58:44,...,2016/8/1 13:07:16,NaN,NaN,NaN,330,NaN,NaN,1,18688880173,孙熙凯
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
940,641,1095,8,NaN,1492,1013,679,12,679,2016/8/31 21:23:48,...,2016/8/31 21:31:48,NaN,NaN,NaN,330,NaN,NaN,1,18688880307,李靖
941,672,1089,6,NaN,1489,1010,800,24,800,2016/8/31 21:24:12,...,2016/8/31 21:56:12,NaN,NaN,NaN,330,NaN,NaN,1,18688880305,莫言
942,692,1155,8,NaN,1492,1013,735,10,735,2016/8/31 21:25:18,...,2016/8/31 21:33:34,NaN,NaN,NaN,330,NaN,NaN,1,18688880327,习一冰
943,647,1094,4,NaN,1485,1006,262,9,262,2016/8/31 21:37:39,...,2016/8/31 21:55:39,NaN,NaN,NaN,330,NaN,NaN,1,18688880207,章春华
944,570,1113,8,NaN,1517,1038,589,13,589,2016/8/31 21:41:56,...,2016/8/31 21:32:56,NaN,NaN,NaN,330,NaN,NaN,1,18688880313,唐雅嘉

In [25]:
A.iloc[:5,[11]]

           lock_time
0  2016/8/1 11:11:46
1  2016/8/1 11:31:55
2  2016/8/1 12:54:37
3  2016/8/1 13:08:20
4  2016/8/1 13:07:16

In [26]:
A.iloc[:5,[9,11,-1]]

      use_start_time          lock_time name
0  2016/8/1 11:05:36  2016/8/1 11:11:46  苗宇怡
1  2016/8/1 11:15:57  2016/8/1 11:31:55   赵颖
2  2016/8/1 12:42:52  2016/8/1 12:54:37  徐毅凡
3  2016/8/1 12:51:38  2016/8/1 13:08:20  张大鹏
4  2016/8/1 12:58:44  2016/8/1 13:07:16  孙熙凯

In [27]:
A.iloc[:5,11]

0    2016/8/1 11:11:46
1    2016/8/1 11:31:55
2    2016/8/1 12:54:37
3    2016/8/1 13:08:20
4    2016/8/1 13:07:16
Name: lock_time, dtype: object

In [28]:
for i in A.iloc[:5,11]:
    iy = pd.Timestamp(i).year
    im = pd.Timestamp(i).month
    iD = pd.Timestamp(i).day
    iw = pd.Timestamp(i).day_name()
    print(iy,'年',im,'月',iD,'日',iw)

2016 年 8 月 1 日 Monday
2016 年 8 月 1 日 Monday
2016 年 8 月 1 日 Monday
2016 年 8 月 1 日 Monday
2016 年 8 月 1 日 Monday

# 5

In [58]:
T = []
E = []
T1= []
for i in range(len(A.iloc[:,11])):
    try:
        timea = time.strptime(A.iloc[i,11], "%Y/%m/%d %H:%M:%S")
        timeb = time.mktime(timea)
        timec = time.strptime(A.iloc[i,9], "%Y/%m/%d %H:%M:%S")
        timed = time.mktime(timec)
        Time = timeb - timed
        Time1 = time.localtime(Time)
        Time2 = time.strftime("%M:%S",Time1)
        T.append(Time2)
    except (TypeError,OSError) as e:
        E.append('有问题的行'+str(i)+str(e))
print('max',max(T),'min',min(T))
    #S.append(time.strptime(A.iloc[i,11]),-int(A.iloc[i,9],))

max 55:41 min 00:00